tutorials/droplet/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0 0 0)  //0
    (10 0 0)  //1
    (10 5 0)  //2
    (0 5 0)  //3
    (0 0 2)  //4
    (10 0 2)  //5
    (10 5 2)  //6
    (0 5 2)  //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    lowerWall
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    front
    {
        type empty;
        faces
        (
            (7 6 2 3)
        );
    }
    back
    {
        type empty;
        faces
        (
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
